src/data_analysis/collected_data/mango/api/standardb12ms/j/load_read.txt
Running 60m test @ http://13.87.77.10:60/wrk2-api/home-timeline/read
  2 threads and 1000 connections
  Thread calibration: mean lat.: 7.002ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 7.031ms, rate sampling interval: 24ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.80s    10.89s   42.43s    62.81%
    Req/Sec   531.67    253.73     1.23k    69.32%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.48s 
 75.000%   22.43s 
 90.000%   30.03s 
 99.000%   42.43s 
 99.900%    0.86m 
 99.990%    0.98m 
 99.999%    1.07m 
100.000%    1.17m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.126     0.000000            1         1.00
    1159.167     0.100000       355865         1.11
    4038.655     0.200000       711668         1.25
    7110.655     0.300000      1067525         1.43
   10264.575     0.400000      1423650         1.67
   13484.031     0.500000      1779658         2.00
   15155.199     0.550000      1957256         2.22
   16875.519     0.600000      2135859         2.50
   18644.991     0.650000      2314067         2.86
   20479.999     0.700000      2491949         3.33
   22429.695     0.750000      2668844         4.00
   23478.271     0.775000      2757605         4.44
   24592.383     0.800000      2846547         5.00
   25772.031     0.825000      2936158         5.71
   27033.599     0.850000      3024798         6.67
   28442.623     0.875000      3114053         8.00
   29212.671     0.887500      3158459         8.89
   30031.871     0.900000      3202252        10.00
   30932.991     0.912500      3246771        11.43
   31932.415     0.925000      3291395        13.33
   33062.911     0.937500      3335740        16.00
   33685.503     0.943750      3357935        17.78
   34373.631     0.950000      3380182        20.00
   35160.063     0.956250      3403202        22.86
   36012.031     0.962500      3425317        26.67
   36962.303     0.968750      3446847        32.00
   37552.127     0.971875      3458382        35.56
   38141.951     0.975000      3469145        40.00
   38830.079     0.978125      3480565        45.71
   39583.743     0.981250      3491402        53.33
   40468.479     0.984375      3502748        64.00
   40927.231     0.985938      3508006        71.11
   41451.519     0.987500      3513582        80.00
   42041.343     0.989062      3519108        91.43
   42729.471     0.990625      3524794       106.67
   43515.903     0.992188      3530377       128.00
   43974.655     0.992969      3533083       142.22
   44466.175     0.993750      3535762       160.00
   45023.231     0.994531      3538676       182.86
   45645.823     0.995313      3541428       213.33
   46333.951     0.996094      3544108       256.00
   46759.935     0.996484      3545522       284.44
   47251.455     0.996875      3546908       320.00
   47775.743     0.997266      3548289       365.71
   48398.335     0.997656      3549703       426.67
   49086.463     0.998047      3551059       512.00
   49479.679     0.998242      3551747       568.89
   49905.663     0.998437      3552443       640.00
   50429.951     0.998633      3553158       731.43
   50954.239     0.998828      3553844       853.33
   51609.599     0.999023      3554512      1024.00
   52002.815     0.999121      3554883      1137.78
   52363.263     0.999219      3555206      1280.00
   52822.015     0.999316      3555555      1462.86
   53346.303     0.999414      3555901      1706.67
   54067.199     0.999512      3556255      2048.00
   54460.415     0.999561      3556434      2275.56
   54853.631     0.999609      3556602      2560.00
   55312.383     0.999658      3556777      2925.71
   55771.135     0.999707      3556944      3413.33
   56328.191     0.999756      3557122      4096.00
   56688.639     0.999780      3557212      4551.11
   57016.319     0.999805      3557300      5120.00
   57442.303     0.999829      3557380      5851.43
   57901.055     0.999854      3557466      6826.67
   58392.575     0.999878      3557551      8192.00
   58687.487     0.999890      3557593      9102.22
   59047.935     0.999902      3557637     10240.00
   59441.151     0.999915      3557681     11702.86
   59867.135     0.999927      3557725     13653.33
   60325.887     0.999939      3557769     16384.00
   60555.263     0.999945      3557790     18204.44
   60915.711     0.999951      3557810     20480.00
   61243.391     0.999957      3557832     23405.71
   61538.303     0.999963      3557854     27306.67
   61997.055     0.999969      3557878     32768.00
   62160.895     0.999973      3557886     36408.89
   62390.271     0.999976      3557898     40960.00
   62586.879     0.999979      3557907     46811.43
   62947.327     0.999982      3557920     54613.33
   63406.079     0.999985      3557930     65536.00
   63700.991     0.999986      3557935     72817.78
   64028.671     0.999988      3557941     81920.00
   64192.511     0.999989      3557946     93622.86
   64487.423     0.999991      3557951    109226.67
   64716.799     0.999992      3557956    131072.00
   64978.943     0.999993      3557960    145635.56
   65110.015     0.999994      3557962    163840.00
   65470.463     0.999995      3557964    187245.71
   65568.767     0.999995      3557967    218453.33
   66027.519     0.999996      3557971    262144.00
   66027.519     0.999997      3557971    291271.11
   66125.823     0.999997      3557973    327680.00
   66256.895     0.999997      3557974    374491.43
   66289.663     0.999998      3557975    436906.67
   67076.095     0.999998      3557977    524288.00
   67076.095     0.999998      3557977    582542.22
   67960.831     0.999998      3557978    655360.00
   68091.903     0.999999      3557979    748982.86
   68091.903     0.999999      3557979    873813.33
   68419.583     0.999999      3557980   1048576.00
   68419.583     0.999999      3557980   1165084.44
   68747.263     0.999999      3557981   1310720.00
   68747.263     0.999999      3557981   1497965.71
   68747.263     0.999999      3557981   1747626.67
   69795.839     1.000000      3557982   2097152.00
   69795.839     1.000000      3557982   2330168.89
   69795.839     1.000000      3557982   2621440.00
   69795.839     1.000000      3557982   2995931.43
   69795.839     1.000000      3557982   3495253.33
   69992.447     1.000000      3557983   4194304.00
   69992.447     1.000000      3557983          inf
#[Mean    =    14799.649, StdDeviation   =    10891.078]
#[Max     =    69926.912, Total count    =      3557983]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3567452 requests in 60.00m, 48.22GB read
  Socket errors: connect 0, read 217, write 31392, timeout 244228
  Non-2xx or 3xx responses: 34
Requests/sec:    990.96
Transfer/sec:     13.72MB